/* NSKeyValueValidationError, user entered a value which was invalid for a field */
"Err1024-C" = "Virheellinen arvo.";

/* NSKeyValueValidationError, argument is a string or number which was invalid for entry into a field */
"Err1024.o" = "Arvo ”%@” on virheellinen.";

/* NSFormattingError */
"Err2048-C" = "Muotoiluvirhe.";

/* NSFileLockingError */
"Err255-C" = "Tiedostoa ei voitu lukita.";

/* NSFileLockingError */
"Err255-R" = "Tiedosto saattaa jo olla lukittu tai sinulla ei ole oikeuksia lukita sitä.";

/* NSFileLockingError, argument is a file name */
"Err255.f" = "Tiedostoa ”%@” ei voitu lukita.";

/* NSFileReadUnknownError */
"Err256" = "Tiedostoa ei voitu avata.";

/* NSFileReadUnknownError, argument is a file name */
"Err256.f" = "Tiedostoa ”%@” ei voitu avata.";

/* NSFileReadNoPermissionError */
"Err257" = "Tiedostoa ei voitu avata, koska tarvittavat käyttöoikeudet puuttuvat.";

/* NSFileReadNoPermissionError */
"Err257-C" = "Käyttöoikeutesi eivät riitä.";

/* NSFileReadNoPermissionError; ; suggestion applies to files or folders, hence the use of the word item */
"Err257-R" = "Jos haluat tarkastella tai muuttaa käyttöoikeuksia, valitse kohde Finderissa ja valitse Arkisto > Näytä tietoja.";

/* NSFileReadNoPermissionError, argument is a file name */
"Err257.f" = "Tiedostoa ”%@” ei voitu avata, koska tarvittavat käyttöoikeudet puuttuvat.";

/* NSFileReadInvalidFileNameError */
"Err258-C" = "Virheellinen tiedostonimi.";

/* NSFileReadInvalidFileNameError, argument is a file or folder name */
"Err258.f" = "Kohdetta ei voitu avata, koska tiedostonimi ”%@” on virheellinen.";

/* NSFileReadCorruptFileError */
"Err259" = "Tiedostoa ei voitu avata, koska se ei ole oikeassa muodossa.";

/* NSFileReadCorruptFileError */
"Err259-C" = "Tiedoston muoto on väärä.";

/* NSFileReadCorruptFileError */
"Err259-R" = "Tiedosto voi olla vioittunut tai eri muodossa kuin luulet.";

/* NSFileReadCorruptFileError, argument is a file name */
"Err259.f" = "Tiedostoa ”%@” ei voitu avata, koska se ei ole oikeassa muodossa.";

/* NSFileReadNoSuchFileError */
"Err260-C" = "Tiedostoa ei ole olemassa.";

/* NSFileReadNoSuchFileError, argument is a file name */
"Err260.f" = "Tiedostoa ”%@” ei ole olemassa.";

/* NSFileReadInapplicableStringEncodingError */
"Err261" = "Tiedostoa ei voitu avata käyttäen määriteltyä tekstikoodausta.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-C" = "Haluttua tekstikoodausta ei voida käyttää.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261-C.e" = "Tekstikoodausta %@ ei voida käyttää.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-R" = "Tiedosto on ehkä tallennettu toisella merkkikoodauksella tai se ei ole tekstitiedosto.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.e" = "Tiedostoa ei voitu avata käyttäen tekstikoodausta %@.";

/* NSFileReadInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.ef" = "Tiedostoa ”%2$@” ei voitu avata käyttäen tekstikoodausta %1$@.";

/* NSFileReadUnsupportedSchemeError */
"Err262" = "Tiedostoa ei voitu avata, koska määriteltyä osoitetyyppiä ei tueta.";

/* NSFileReadUnsupportedSchemeError */
"Err262-C" = "Määriteltyä osoitetyyppiä ei tueta.";

/* NSFileReadUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err262.fu" = "Tiedostoa ”%1$@” ei voitu avata, koska osoitetyyppiä %2$@ ei tueta.";

/* NSFileReadUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err262.u" = "Tiedostoa ei voitu avata, koska osoitetyyppiä %@ ei tueta.";

/* NSFileReadTooLargeError */
"Err263" = "Tiedostoa ei voitu avata, koska se on liian suuri.";

/* NSFileReadTooLargeError, reason string */
"Err263-C" = "Tiedosto on liian suuri.";

/* NSFileReadTooLargeError, argument is a file name */
"Err263.f" = "Tiedostoa ”%@” ei voitu avata, koska se on liian suuri.";

/* NSFileReadUnknownStringEncodingError */
"Err264" = "Tiedostoa ei voitu avata, koska sisällön tekstikoodausta ei voitu määrittää.";

/* NSFileReadUnknownStringEncodingError, reason string */
"Err264-C" = "Sisällön tekstikoodausta ei voitu määrittää.";

/* NSFileReadUnknownStringEncodingError, recovery suggestion */
"Err264-R" = "Tiedosto voidaan ehkä avata määrittelemällä tekstikoodaus.";

/* NSFileReadUnknownStringEncodingError, argument is a file name */
"Err264.f" = "Tiedostoa ”%@” ei voitu avata, koska sisällön tekstikoodausta ei voitu määrittää.";

/* NSUserCancelledError */
"Err3072-C" = "Toiminto kumottiin.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4(Remove).f" = "Kohdetta ”%@” ei voitu poistaa.";

/* NSFileNoSuchFileError */
"Err4-C" = "Tiedostoa ei ole olemassa.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4.f" = "Tiedostoa ”%@” ei ole olemassa.";

/* NSFileWriteUnknownError */
"Err512" = "Tiedostoa ei voitu tallentaa.";

/* NSFileWriteUnknownError, first argument is the source, second argument is the destination */
"Err512(Copy).fp" = "Kohdetta ”%1$@” ei voitu kopioida kohteeseen ”%2$@”.";

/* NSFileWriteUnknownError, first arg: source, second arg: destination */
"Err512(Link).fp" = "Kohdetta ”%1$@” ei voitu linkittää kohteeseen ”%2$@”.";

/* NSFileWriteUnknownError, first arg: source file, second arg: destination file */
"Err512(Move).fp" = "Kohdetta ”%1$@” ei voitu siirtää kohteeseen ”%2$@”.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Remove).f" = "Kohdetta ”%@” ei voitu poistaa.";

/* NSFileWriteUnknownError, arguments are folder name where the file was going to be saved, and file name */
"Err512.df" = "Tiedostoa ”%2$@” ei voitu tallentaa kansioon ”%1$@”.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512.f" = "Tiedostoa ”%@” ei voitu tallentaa.";

/* NSFileWriteNoPermissionError */
"Err513" = "Tiedostoa ei voitu tallentaa, koska tarvittavat käyttöoikeudet puuttuvat.";

/* NSFileWriteNoPermissionError, first argument is the source, second argument is the destination */
"Err513(Copy).fp" = "Kohdetta ”%1$@” ei voitu kopioida, koska sinulla ei ole tarvittavia käyttöoikeuksia kohteeseen ”%2$@”.";

/* NSFileWriteNoPermissionError, first arg: source, second arg: destination */
"Err513(Link).fp" = "Kohdetta ”%1$@” ei voitu linkittää, koska sinulla ei ole tarvittavia käyttöoikeuksia kohteeseen ”%2$@”.";

/* NSFileWriteNoPermissionError, first arg: source file, second arg: destination file */
"Err513(Move).fp" = "Kohdetta ”%1$@” ei voitu siirtää, koska sinulla ei ole tarvittavia käyttöoikeuksia kohteeseen ”%2$@”.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Remove).f" = "Kohdetta ”%@” ei voitu poistaa, koska sinulla ei ole tarvittavia käyttöoikeuksia.";

/* NSFileWriteNoPermissionError */
"Err513-C" = "Käyttöoikeutesi eivät riitä.";

/* NSFileWriteNoPermissionError; suggestion applies to files or folders, hence the use of the word item */
"Err513-R" = "Jos haluat tarkastella tai muuttaa käyttöoikeuksia, valitse kohde Finderissa ja valitse Arkisto > Näytä tietoja.";

/* NSFileWriteNoPermissionError, arguments are folder name where the file was going to be saved, and file name */
"Err513.df" = "Sinulla ei ole tiedoston ”%2$@” kansioon ”%1$@” tallentamiseen tarvittavia käyttöoikeuksia.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513.f" = "Sinulla ei ole tiedoston ”%@” tallentamiseen tarvittavia käyttöoikeuksia.";

/* NSFileWriteInvalidFileNameError */
"Err514" = "Kohdetta ei voitu tallentaa, koska tiedostonimi on virheellinen.";

/* NSFileWriteInvalidFileNameError, argument is a file name */
"Err514(Remove).f" = "Kohdetta ei voitu poistaa, koska tiedostonimi ”%@” on virheellinen.";

/* NSFileWriteInvalidFileNameError */
"Err514-C" = "Virheellinen tiedostonimi.";

/* NSFileWriteInvalidFileNameError, argument is a file or folder name */
"Err514.f" = "Kohdetta ei voitu tallentaa, koska tiedostonimi ”%@” on virheellinen.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517" = "Tiedostoa ei voitu tallentaa käyttäen määriteltyä tekstikoodausta.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-C" = "Haluttua tekstikoodausta ei voida käyttää.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517-C.e" = "Tekstikoodausta %@ ei voida käyttää.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-R" = "Valitse toinen tekstikoodaus, jos se on mahdollista.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.e" = "Tiedostoa ei voitu tallentaa käyttäen tekstikoodausta %@.";

/* NSFileWriteInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.ef" = "Tiedostoa ”%2$@” ei voitu tallentaa käyttäen tekstikoodausta %1$@.";

/* NSFileWriteUnsupportedSchemeError */
"Err518" = "Tiedostoa ei voitu tallentaa, koska määritelty osoitetyyppiä ei tueta.";

/* NSFileWriteUnsupportedSchemeError */
"Err518-C" = "Määriteltyä osoitetyyppiä ei tueta.";

/* NSFileWriteUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err518.fu" = "Tiedostoa ”%1$@” ei voitu tallentaa, koska osoitetyyppiä %2$@ ei tueta.";

/* NSFileWriteUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err518.u" = "Tiedostoa ei voitu tallentaa, koska osoitetyyppiä %@ ei tueta.";

/* NSFileWriteOutOfSpaceError */
"Err640" = "Tiedostoa ei voitu tallentaa, koska tilaa ei ole tarpeeksi.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Copy).fp" = "Kohdetta ”%1$@” ei voitu kopioida kohteeseen ”%2$@”, koska siinä ei ole tarpeeksi tilaa.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Link).fp" = "Kohdetta ”%1$@” ei voitu linkittää kohteeseen ”%2$@”, koska siinä ei ole tarpeeksi tilaa.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Move).fp" = "Kohdetta ”%1$@” ei voitu siirtää kohteeseen ”%2$@”, koska siinä ei ole tarpeeksi tilaa.";

/* NSFileWriteOutOfSpaceError */
"Err640-C" = "Tilaa ei ole tarpeeksi.";

/* NSFileWriteOutOfSpaceError, argument is volume name */
"Err640-C.v" = "Taltio ”%@” on täynnä.";

/* NSFileWriteOutOfSpaceError */
"Err640-R" = "Poista tiedostoja taltiolta ja yritä uudestaan.";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640.f" = "Tiedostoa ”%@” ei voida tallentaa, koska tilaa ei ole tarpeeksi.";

/* NSFileWriteOutOfSpaceError, arguments are file name and volume name */
"Err640.fv" = "Tiedostoa ”%1$@” ei voida tallentaa, koska taltio ”%2$@” on täynnä.";

/* A fallback error message. %@ is the error domain name, %ld is the error number */
"Operation could not be completed. (%@ error %ld.)" = "Toimintoa ei voitu suorittaa. (%1$@ virhe %2$ld.)";

